---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.VerticalLayerExtensionFailure
source: html/32ce838f-aaee-90ee-a62b-d519a8f1435c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.VerticalLayerExtensionFailure Property

Cannot extend layer(s) of the highlighted vertically compound wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId VerticalLayerExtensionFailure { get; }
```